# ItemFactoryBase Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ItemFactoryBase Class
Members See Also
---
The ItemFactoryBase object is used to create new instances of elements within the Autodesk Revit document.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ItemFactoryBase : APIObject
```

Visual Basic
---
```text
Public Class ItemFactoryBase _
	Inherits APIObject
```

Visual C++
---
```text
public ref class ItemFactoryBase : public APIObject
```

# Remarks
The ItemFactoryBase object is a utility object that is used to create new instances of elements within the Autodesk Revit document. This class holds common methods used in both project documents and family documents.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.Creation..::..ItemFactoryBase Autodesk.Revit.Creation..::..Document Autodesk.Revit.Creation..::..FamilyItemFactory
# See Also
ItemFactoryBase Members
Autodesk.Revit.Creation Namespace